[
    {
        "name": "SimplyFire Cooking Gloves",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51LPEBrTePL._AC_US218_.jpg",
        "price": 19.97,
        "reviews": 4.76,
        "description": "Are You Frustrated With Cheap And Flimsy Oven Mitts That Just Can't Stand The Heat? SimplyFire Cooking Gloves Allow You To Be Efficient And Move The Way You Need, When You Need It! The High Quality Fiber Is Lightweight And Has Extremely Powerful Heat Resistant Properties.",
        "weight": 9.8,
        "highlights": [
            "COMPLETE & AUTHENTIC PROTECTION - Safely protect your hands and forearms up to 475°F. Flame and extreme heat resistant. These multifunctional gloves are great for use on the BBQ, smoking, fire pit, fireplace, camping, grilling, baking, and all around cooking. Claiming gloves can protect up to 932°F is not true!",
            "COMFORT & SAFE GRIP - 100% cotton lining for the utmost comfort. These heat resistant gloves are equipped with raised anti-skid silicone stripes for premium gripping ability. Reduce the risk of objects slipping out of your hands. Perfect for indoor & outdoor cooking.",
            "LIGHTWEIGHT & DURABLE QUALITY - While being heavy duty and extremely flexible, the Aramid (Kevlar & Nomax) fiber solves the problem of poor dexterity. The five-finger design allows you to be agile and precise when you need it most!",
            "STRETCH CAPABILITY & CONVENIENT - One size fits all. The stretch power of these gloves allows for a great universal fit. Your hands will always be perfectly comfortable with a relaxed “hugged” feeling. Easy to put on and easy off. Machine washable.",
            "100% MONEY-BACK GUARANTEE - We are positive you will enjoy your cooking gloves! But we still want you to know all risk is removed from your purchase. If you aren’t completely satisfied, return your gloves no questions asked. Customer satisfaction is our top priority!"
        ]
    },
    {
        "name": "USA Kitchen Elite - 18 inch Best BBQ Grill Brush",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51vWFWSbzrL._AC_US218_.jpg",
        "price": 19.87,
        "reviews": 4.5,
        "description": "Cleaning your grill can be a hard mission, especially if you’re a barbeque lover. Cleaning your grill takes a lot of effort and can be painfully frustrating without the proper tool and getting more than just the top of the grill cleaned requires a special designed grill brush. Getting all that burnt on grease stuck to the sides of the grill becomes just a formality with our new 360 degree stainless steel woven wire brush. It’s hard-wired stainless steel bristles cut through the toughest residue without scratching your grill.",
        "weight": 8,
        "highlights": [
            "EFFORTLESS CLEANING: With a unique design, this 18 inch long barbecue brush has three brushes in one, each with its own equivalent stroke. Be prepared to clean every bit of residue with its inovative 360 degree rotatorblade to remove hard corners.",
            "UNIVERSAL BARBECUE GRILL BRUSH: It is a universal grill brush that can be used with multiple gas grill, charcoal grill, smoker grill, porcelain grill, infrared grill and all other types and makes like Weber grill or Foreman grill",
            "LONG HANDLE: A long and strong handle of 10 inches, it will keep you safe from the heat generated by the barbeque grill, at the same time making it easier for you to apply as much pressure as you can",
            "DURABLE: Crafted with stainless steel and a high quality plastic handle, the grill brush will last longer with a guarantee of a durable and effortless usage",
            "A GREAT GIFT: USA Kitchen Elite ® BBQ Grill Brush - a Perfect Gift for your friends and family members who love to do BBQs No Risk - 1 Year Warranty - 100% Money Back Guarantee!"
        ]
    },
    {
        "name": "NEXGADGET Stainless Steel and Nylon Kitchen Utensils Set, 38 Pieces",
        "image": "https://images-na.ssl-images-amazon.com/images/I/5139uOlPQML._AC_US218_.jpg",
        "price": 39.99,
        "reviews": 4.3,
        "description": "NexGadget offers a wide and varied selection of kitchen accessories at competitive prices designed for any home, this 38-piece tool and gadget set is the ultimate set to tackle all your culinary needs. They are stylish, easy to clean and durable for everyday use. Each piece is constructed from sturdy, durable Nylon and stainless steel components for great performance.",
        "weight": 68.8,
        "highlights": [
            "DELUXE KITCHEN STARTER SET: Stylish, easy to clean and durable for everyday use. Each piece is constructed from sturdy, durable Nyon and stainless steel components for great performance.",
            "NYLON UTENSILS (18Pcs) : Basting Spoon, Slotted Spoon, Slotted Turner, Spaghetti Server, Ladle, Oval Turner, Oval Slotted Turner, Skimmer, Turner, Sauce Ladle, Whisk, Potato Masher, Icing Knife, Bent Icing Knife, Fork, Meat Fork, Chef Slotted Turner, Cooking Tongs. NOTICE HERE: Nylon untensils heat resistant up to 400°F/ 210°C.",
            "EXTRA TOOL AND GADGET SET (20Pcs): Pizza Cutter, Bottle Opener, Cheese Grater, Flat Grater, Can Opener, Peeler, Kitchen Scissor, 3Pcs of Scrapers Set, 5Pcs Measuring Cups and 5Pcs Measuring Spoons. Measuring cup capacity: 1/8-cup, 1/4-cup, 1/3-cup, 1/2-cup and 1-cup and Measuring spoon capacity: 1/4-teaspoon, 1/2-teaspoon, 1-teaspoon, 1/2-tablespoon and 1-tablespoon.",
            "DURABLE AND VERSATILE DESIGN: Heatproof nylon and stainless steel to prevent scratching, scuffing or damaging your cookware. The ergonomic nylon grips and large handles ensure easy grip and maximum control while cooking. All tools are dishwasher safe for easy clean up, except the can opener which should be hand washed. Equipped with hanging loops for convenient compact storage.",
            "VALUED GIFT-PACK FOR YOUR FAMILY/FRIEND/YOURSELF: This kitchen utensils will offer you everything for all food prep tasks, without costing you a fortune buying each piece individually. Comes with nice packaged box,best gift for festivals, housewarming party or even Christmas."
        ]
    },
    {
        "name": "Buytra Sponge Holder, Kitchen Sink Caddy Suction Cup Holder for Sponges, Soap, Scrubbers, Cleaning Brush, Green",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51Hx0rlObJL._AC_US218_.jpg",
        "price": 8.69,
        "reviews": 4.0,
        "description": "The sponge holder with suction is a convenient way to store and organize scrubbies, sponges, brushes, drain stoppers and more! Keep water off of the counter.",
        "weight": 68.8,
        "highlights": [
            "Made of environmental friendly plastic, non toxic and safe to use",
            "COMPACT DESIGN: The triangle design which fully make use of the space of the sink corner and won't take up additional space inside the sink",
            "With a reusable suction cup at the back to keep this caddy fixed, easy and durable to use",
            "Draining slots design allows water to drain, letting sponges and scrubbers dry; A big hole at the bottom helps to keep cleaning brushes in place",
            "Great for kitchen and bathroom: Hold your dishsoap, hand soap, sponge and scrubber and keeps the liquid soap from your countertop Very handy with keeping your sink countertop organized."            
         ]
    },
    {
        "name": "DII 100% Cotton, Machine Washable, Everyday Kitchen Basic Terry Potholder Set of 3, Aqua",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51dCJPMbmYL._AC_US218_.jpg",
        "price": 5.99,
        "reviews": 4.3,
        "description": "Terry cloth is a favorite material for creating highly functional kitchen textiles. DII offers terry oven mitts, potholders, dishtowels, and dishcloths in coordinating colors. The terry cloth loops offer softness and comfort while the thickness increases its sturdiness and longevity.",
        "weight": 4,
        "highlights": [
            "QUALITY ASSURANCE, LONG-LASTING MATERIAL: 100% Terry cotton and quilting allows for easy flexibility in these potholders, offer durability and grip",
            "EASY STORAGE FOR DAILY USE: Set includes 3 potholders measure 7x7 inches, each with a hanging loop allows for easy storage. Perfect for daily use and coordinate well with your home and kitchen",
            "PROTECT YOUR HANDS FROM HEAT: Heat resistant allowing you to safely remove dishes from the oven and hot pots from the stove",
            "GREAT GIFT CHOICE WITH MANY COLORS: This easy care pot holders come with multiple colors, perfect for Mother's day, birthday, holidays, housewarming and hostess gifts.",
            "CARE TIPS: Machine washable and durable for daily use -Wash with Cold Water in Gentle Cycle & Tumble Dry Low."
        ]
    },
    {
        "name": "Collections ETC Set of 4 Fiberglass Stovetop Burner Protectors, 10.5-Inch, Black",
        "image": "https://images-na.ssl-images-amazon.com/images/I/41U+FW7ydvL._AC_US218_.jpg",
        "price": 8.39,
        "reviews": 2.4,
        "description": "Hate scrubbing your stovetop? Simply place these fiberglass stovetop protectors over your gas burner areas, and your stovetop will stay clean and protected. Protectors easily catch splatters and spills. Can be wiped clean with soapy water.",
        "weight": 1.6,
        "highlights": [
            "Place these fiberglass stovetop protectors over your gas burner areas, and your stovetop will stay clean and protected",
            "Protectors easily catch splatters and spills",
            "Set of 4 protectors; Simply cut for a custom fit; Made from fiberglass",
            "Shop with confidence! For over 50 years, Collections Etc has been bringing unique, whimsical, inspirational, and home solution products to customers. All Collections Etc products come with a 60 day, easy return policy and 100% satisfaction guarantee"
        ]
    },
    {
        "name": "Rubbermaid Easy Find Lids Food Storage Container, 42-Piece Set, Red",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51UiNsrVRhL._AC_US218_.jpg",
        "price": 19.90,
        "reviews": 4.6,
        "description": "Find the right lid, right now! Rubbermaid Easy Find Lids food storage containers feature lids that snap to the container base and to other lids, which means the right lid is always at your fingertips. The square-shape food containers give you more space in the fridge and graduated sizes nest for cupboard storage.",
        "weight": 60.8,
        "highlights": [
            "Lids snap together and to container bases so you can always find the right lid",
            "Graduated sized containers nest for compact storage",
            "One lid fits multiple bases; Thick, durable container walls for everyday use",
            "Microwave, freezer and dishwasher-safe, BPA-free, Made in the USA",
            "Set includes: 5 (0.5 Cup), 5 (1.25 Cup), 5 (2 Cup), 2 (3 Cup), 2 (5 Cup), 2 (7 Cup); Lids included"
        ]
    },
    {
        "name": "Oggi 4-Piece Acrylic Canister Set with Airtight Lids and Acrylic Spoons",
        "image": "https://images-na.ssl-images-amazon.com/images/I/514J-v-mKZL._AC_US218_.jpg",
        "price": 23.81,
        "reviews": 4.3,
        "description": "This Oggi canister set is a must-have. Store popcorn, cereal, sugar and so much more in this 4-piece canister set. Sizes include: 28oz, 38oz, 59oz, 72oz. Clear acrylic lets you see what's inside. Lightweight, yet strong and break resistant. Ideal for organizing your pantry shelf.",
        "weight": 56,
        "highlights": [
            "Great for use storing cookies, sugar, flour, spices and other kitchen staples",
            "Ideal for organizing your pantry shelf",
            "Airtight lid with silicone gaskets to help preserve stored food items"
        ]
    },
    {
        "name": "Large Dish Drainer Rack,Stainless Steel Over the Sink Kitchen Countertop Folding Roll Up Dish Drying Rack",
        "image": "https://images-na.ssl-images-amazon.com/images/I/514NcGIHOvL._AC_US218_.jpg",
        "price": 12.99,
        "reviews": 4.0,
        "description": "Made of tough stainless steel, this drying rack is very solid and sturdy, and will beautifully resist to constant use and rust for years.",
        "weight": 12,
        "highlights": [
            "Constructed from Stainless Steel and non-slip silicone grips - sturdy and durable, and will not rust for years.",
            "Excellent Permeability - ideal for rinsing and drying fresh fruit and vegetables or as a draining rack for dishes and cups, water drips directly into sink.",
            "Wider And Larger - fits over sink or on countertop, offers you MORE usable working room."
        ]
    },
    {
        "name": "Yummy Sam Lid and Spoon Rest",
        "image": "https://images-na.ssl-images-amazon.com/images/I/41Oo4vRR15L._AC_US218_.jpg",
        "price": 8.99,
        "reviews": 4.6,
        "description": "Yummy Sam Spoon rest is made of high quality stainless steel. It is a good helper to make your counters and stovetops clean and tidy.",
        "weight": 12,
        "highlights": [
            "Designed with a spot to place all sizes of lids, spoons, splatter screens, and cooking utensils, keeping your counters and stovetops clean and tidy.",
            "Made of attractive, durable stainless steel, rust-resistant, pass SGS, LFGB, FDA, CE",
            "Complements any kitchen decor. Perfert for a kitchen lover.",
            "Dishwasher safe and durable."
        ]
    }
]